>>> 123 + 222 # Целочисленное сложение
345
>>> 1.5 * 4 # Умножение вещественных чисел
6.0
>>> 2 ** 100 # 2 в степени 100
1267650600228229401496703205376

>>> len(str(2 ** 1000000)) # Сколько цифр в действительно БОЛЬШОМ числе?
301030

>>> 3.1415 * 2 # repr: как программный код
6.2830000000000004

>>> print(3.1415 * 2) # str: более дружественный формат
6.283


>>> import math
>>> math.pi
3.1415926535897931
>>> math.sqrt(85)
9.2195444572928871


>>> import random
>>> random.random()
0.59268735266273953
>>> random.choice([1, 2, 3, 4])
1
