while <test>:         #Условное выражение test
  <statements1>        #Тело цикла
else:                 #необязательная часть else
  <statements1>       #Выполняется если выход из цикла производится не инструкцией bread
  
while True:     #выполняется пока значение равно истине


x = 'spam'
while x:            #выполняется пока не пустая строка
  print(x, end = '')      #end = '' обеспечивает вывод значений в одну строку через пробел
  x = x[1:]          #вырезать первый  символ из переменной x
  
  
  
  
  
