#1. Дано натуральное число. Выведите его последнюю цифру.

a = input("Enter number")
b = len(a)
print(a[b - 1])
