#include "String.h"
#include <iostream>


int main()
{
	String s1;					// используем конструктор без параметров
	char xstr[] = "Hello! ";	// создаем обычную строку 

////////////////
	s1 = xstr;					 // неявно используем конструктор с одним параметром 
////////////////

	s1.ShowStr();				

	String s2("World!");

////////////////////////////////////////////////////////////////////////////////////
	std::cout << static_cast<char*>(s2);		//компилятору не известно об определении
	//типа String, мы опреляем это с помощью оператора static_cast для char*
////////////////////////////////////////////////////////////////////////////////////

	std::cout << std::endl;		 // используем оператор перевода типа 

	return 0;
}
