'''-- |== 
соответствует либо строке -- , либо строке =='''
'''[-=] 
соответствует либо символ -, либо = (множество символов)'''
'''(?:)
Группа без захвата. То же самое, но заключённое в скобках выражение 
не добавляется к списку захваченных фрагментов. 
Например, если требуется найти или «здравствуйте», 
или «здрасте», но не важно, какое именно приветствие найдено,
можно воспользоваться выражением здра(?:сте|вствуйте).'''

>>> import re
>>> re.split('--', 'aaa--bbb-ccc')
['aaa', 'bbb-ccc']
>>> re.split('--', 'aaa--bbb--ccc')
['aaa', 'bbb', 'ccc']
>>> re.sub('--', '...', 'aaa--bbb--ccc')
'aaa...bbb...ccc'
>>> re.split('--|==', 'aaa--bbb==ccc')
['aaa', 'bbb', 'ccc']
>>> re.sub('--|==', '...', 'aaa--bbb==ccc')
'aaa...bbb...ccc'
>>> re.split('[-=]', 'aaa-bbb=ccc')
['aaa', 'bbb', 'ccc']
>>> re.split('(--)|(==)', 'aaa--bbb==ccc')
['aaa', '--', None, 'bbb', None, '==', 'ccc']
>>> re.split('(?:--)|(?:==)', 'aaa--bbb==ccc')
['aaa', 'bbb', 'ccc']
